Refer to Jupyter notes for more detail but to get the DB up and running start the db server:

`pg_ctl -D ./SQLdb/db1 -l logfile start`

May be necessary to change permissions on db1 to 0700 or 0750. See logs if problems starting server

In [1]:
%load_ext sql

In [2]:
%sql postgresql://localhost/parchposey

'Connected: @parchposey'

In [3]:
%sql mysql://root:@localhost/bp

(MySQLdb._exceptions.OperationalError) (1045, "Access denied for user 'root'@'localhost' (using password: NO)")
(Background on this error at: https://sqlalche.me/e/14/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['postgresql://localhost/parchposey'])

In [4]:
%sql select version()

 * postgresql://localhost/parchposey
1 rows affected.

[('PostgreSQL 12.2 on x86_64-pc-linux-gnu, compiled by x86_64-conda_cos6-linux-gnu-cc (crosstool-NG 1.23.0.449-a04d0) 7.3.0, 64-bit',)]

In [5]:
%config SqlMagic

SqlMagic(Magics, Configurable) options
------------------------------------
SqlMagic.autocommit=<Bool>
    Set autocommit mode
    Current: True
SqlMagic.autolimit=<Int>
    Automatically limit the size of the returned result sets
    Current: 0
SqlMagic.autopandas=<Bool>
    Return Pandas DataFrames instead of regular result sets
    Current: False
SqlMagic.column_local_vars=<Bool>
    Return data into local variables from column names
    Current: False
SqlMagic.displaylimit=<Int>
    Automatically limit the number of rows displayed (full result set is still
    stored)
    Current: None
SqlMagic.dsn_filename=<Unicode>
    Path to DSN file. When the first argument is of the form [section], a
    sqlalchemy connection string is formed from the matching section in the DSN
    file.
    Current: 'odbc.ini'
SqlMagic.feedback=<Bool>
    Print number of rows affected by DML
    Current: True
SqlMagic.short_errors=<Bool>
    Don't display the full traceback on SQL Programming Error
    Current: True
SqlMagic.style=<Unicode>
    Set the table printing style to any of prettytable's defined styles
    (currently DEFAULT, MSWORD_FRIENDLY, PLAIN_COLUMNS, RANDOM)
    Current: 'DEFAULT'

In [6]:
%config SqlMagic.autolimit=5

Provide a table for all web_events associated with account name of Walmart.There should be three columns. Be sure to include the primary_poc, time of the event, and the channel for each event. Additionally, you might choose to add a fourth column to assure only Walmart events were chosen.

In [7]:
%%sql
SELECT
	a.primary_poc,
    w.occurred_at,
    w.channel    
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE a.name = 'Walmart'

 * postgresql://localhost/parchposey
39 rows affected.

[('Tamara Tuma', datetime.datetime(2015, 10, 6, 17, 13, 58), 'direct'),
 ('Tamara Tuma', datetime.datetime(2015, 11, 5, 3, 8, 26), 'direct'),
 ('Tamara Tuma', datetime.datetime(2015, 12, 4, 3, 57, 24), 'direct'),
 ('Tamara Tuma', datetime.datetime(2016, 1, 2, 0, 55, 3), 'direct'),
 ('Tamara Tuma', datetime.datetime(2016, 2, 1, 19, 2, 33), 'direct')]

Provide a table that provides the region for each sales_rep along with their associated accounts. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [8]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
ORDER BY a.name;

 * postgresql://localhost/parchposey
351 rows affected.

[('Northeast', 'Sibyl Lauria', '3M'),
 ('Midwest', 'Chau Rowles', 'Abbott Laboratories'),
 ('Midwest', 'Julie Starr', 'AbbVie'),
 ('Southeast', 'Earlie Schleusner', 'ADP'),
 ('West', 'Marquetta Laycock', 'Advance Auto Parts')]

Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. Your final table should have 3 columns: region name, account name, and unit price. A few accounts have 0 for total, so I divided by (total + 0.01) to assure not dividing by zero.

In [9]:
%%sql
SELECT r.name region, a.name account, (o.total_amt_usd/(o.total+0.01)) unit_price
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id

 * postgresql://localhost/parchposey
6912 rows affected.

[('Northeast', 'Walmart', Decimal('5.7596000236672386')),
 ('Northeast', 'Walmart', Decimal('5.9651748203187389')),
 ('Northeast', 'Walmart', Decimal('5.8797060828725097')),
 ('Northeast', 'Walmart', Decimal('5.4442361229475598')),
 ('Northeast', 'Walmart', Decimal('5.9601842312587116'))]

## Lesson 2: Quiz: Last Check

1. Provide a table that provides the region for each sales_rep along with their associated accounts. This time only for the Midwest region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [10]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM region r
JOIN sales_reps s
ON r.id = s.region_id
JOIN accounts a
ON s.id = a.sales_rep_id
WHERE r.name = 'Midwest'
ORDER BY a.name

 * postgresql://localhost/parchposey
48 rows affected.

[('Midwest', 'Chau Rowles', 'Abbott Laboratories'),
 ('Midwest', 'Julie Starr', 'AbbVie'),
 ('Midwest', 'Cliff Meints', 'Aflac'),
 ('Midwest', 'Chau Rowles', 'Alcoa'),
 ('Midwest', 'Charles Bidwell', 'Altria Group')]

2. Provide a table that provides the region for each sales_rep along with their associated accounts. This time only for accounts where the sales rep has a first name starting with S and in the Midwest region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [11]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM region r
JOIN sales_reps s
ON r.id = s.region_id
JOIN accounts a
ON s.id = a.sales_rep_id
WHERE (r.name = 'Midwest' AND s.name LIKE 'S%')
ORDER BY a.name

 * postgresql://localhost/parchposey
5 rows affected.

[('Midwest', 'Sherlene Wetherington', 'Community Health Systems'),
 ('Midwest', 'Sherlene Wetherington', 'Progressive'),
 ('Midwest', 'Sherlene Wetherington', 'Rite Aid'),
 ('Midwest', 'Sherlene Wetherington', 'Time Warner Cable'),
 ('Midwest', 'Sherlene Wetherington', 'U.S. Bancorp')]

3. Provide a table that provides the region for each sales_rep along with their associated accounts. This time only for accounts where the sales rep has a last name starting with K and in the Midwest region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [12]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM region r
JOIN sales_reps s
ON r.id = s.region_id
JOIN accounts a
ON s.id = a.sales_rep_id
WHERE (r.name = 'Midwest' AND s.name LIKE '% K%')
ORDER BY a.name

 * postgresql://localhost/parchposey
13 rows affected.

[('Midwest', 'Delilah Krum', 'Amgen'),
 ('Midwest', 'Delilah Krum', 'AutoNation'),
 ('Midwest', 'Delilah Krum', 'Capital One Financial'),
 ('Midwest', 'Delilah Krum', 'Cummins'),
 ('Midwest', 'Carletta Kosinski', 'Danaher')]

4. Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds 100. Your final table should have 3 columns: region name, account name, and unit price. In order to avoid a division by zero error, adding .01 to the denominator here is helpful total_amt_usd/(total+0.01).

In [13]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total+0.01) unit_price
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id
WHERE standard_qty > 100

 * postgresql://localhost/parchposey
4509 rows affected.

[('Northeast', 'Walmart', Decimal('5.7596000236672386')),
 ('Northeast', 'Walmart', Decimal('5.9651748203187389')),
 ('Northeast', 'Walmart', Decimal('5.4442361229475598')),
 ('Northeast', 'Walmart', Decimal('5.9601842312587116')),
 ('Northeast', 'Walmart', Decimal('6.1687185711808566'))]

5. Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds 100 and the poster order quantity exceeds 50. Your final table should have 3 columns: region name, account name, and unit price. Sort for the smallest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (total_amt_usd/(total+0.01).

In [14]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total+0.01) unit_price
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id
WHERE (o.standard_qty > 100 AND o.poster_qty > 50)
ORDER BY unit_price

 * postgresql://localhost/parchposey
835 rows affected.

[('Northeast', 'State Farm Insurance Cos.', Decimal('5.1192822502542913')),
 ('Southeast', 'DISH Network', Decimal('5.2318158475403638')),
 ('Northeast', 'Travelers Cos.', Decimal('5.2351813313106532')),
 ('Northeast', 'Best Buy', Decimal('5.2604264379300265')),
 ('West', 'Stanley Black & Decker', Decimal('5.2663955600739988'))]

6. Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds 100 and the poster order quantity exceeds 50. Your final table should have 3 columns: region name, account name, and unit price. Sort for the largest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (total_amt_usd/(total+0.01).

In [15]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total+0.01) unit_price
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id
WHERE (o.standard_qty > 100 AND o.poster_qty > 50)
ORDER BY unit_price DESC

 * postgresql://localhost/parchposey
835 rows affected.

[('Northeast', 'IBM', Decimal('8.0899060822781456')),
 ('West', 'Mosaic', Decimal('8.0663292103581285')),
 ('West', 'Pacific Life', Decimal('8.0630226525147913')),
 ('Northeast', 'CHS', Decimal('8.0188493267801133')),
 ('West', 'Fidelity National Financial', Decimal('7.9928024668468328'))]

7. What are the different channels used by account id 1001? Your final table should have only 2 columns: account name and the different channels. You can try SELECT DISTINCT to narrow down the results to only the unique values.

In [16]:
%%sql
SELECT DISTINCT a.name, w.channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE a.id = 1001

 * postgresql://localhost/parchposey
6 rows affected.

[('Walmart', 'adwords'),
 ('Walmart', 'banner'),
 ('Walmart', 'direct'),
 ('Walmart', 'facebook'),
 ('Walmart', 'organic')]

8. Find all the orders that occurred in 2015. Your final table should have 4 columns: occurred_at, account name, order total, and order total_amt_usd.

In [17]:
%%sql
SELECT o.id, o.occurred_at, a.name account, o.total, o.total_amt_usd
FROM orders o
JOIN accounts a
ON o.account_id = a.id
WHERE o.occurred_at BETWEEN '2015-01-01' AND '2015-12-31'
ORDER BY o.occurred_at DESC;

 * postgresql://localhost/parchposey
1715 rows affected.

[(2922, datetime.datetime(2015, 12, 30, 20, 4, 55), 'Occidental Petroleum', 121, Decimal('623.79')),
 (1184, datetime.datetime(2015, 12, 30, 19, 1, 13), 'CHS', 340, Decimal('1819.22')),
 (4803, datetime.datetime(2015, 12, 30, 17, 31, 9), 'Pfizer', 1314, Decimal('8632.07')),
 (2049, datetime.datetime(2015, 12, 30, 17, 30, 33), 'Fluor', 327, Decimal('1762.44')),
 (5555, datetime.datetime(2015, 12, 30, 17, 17, 3), 'Fluor', 869, Decimal('6311.35'))]

## Lesson 3: SQL Aggregations

Concept 11. Quiz: MIN, MAX, & AVG

3 When did the most recent (latest) web_event occur?

In [18]:
%%sql
SELECT MAX(occurred_at) FROM web_events LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[(datetime.datetime(2017, 1, 1, 23, 51, 9),)]

4. Try to perform the result of the previous query without using an aggregation function.

In [19]:
%%sql
SELECT occurred_at FROM web_events ORDER BY occurred_at DESC LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[(datetime.datetime(2017, 1, 1, 23, 51, 9),)]

5. Find:
    - the mean amount spent per order on each paper type eg AVG(standard_amt_usd)
    - the mean amount of each paper type purchased per order AVG(standard_qty)
    Your final answer should have 6 values - one for each paper type for the average number of sales, as well as the average amount.

In [20]:
%%sql
SELECT
    AVG(standard_qty) avg_s_q,
    AVG(poster_qty) avg_p_q,
    AVG(gloss_qty) avg_g_q,
    AVG(standard_amt_usd) avg_s_a,
    AVG(poster_amt_usd) avg_p_a,
    AVG(gloss_amt_usd) avg_g_a
FROM orders

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('280.4320023148148148'), Decimal('104.6941550925925926'), Decimal('146.6685474537037037'), Decimal('1399.3556915509259259'), Decimal('850.1165393518518519'), Decimal('1098.5474204282407407'))]

6. Via the video, you might be interested in how to calculate the MEDIAN. Though this is more advanced than what we have covered so far try finding - what is the MEDIAN total_usd spent on all orders?

In [21]:
%%sql
SELECT total_amt_usd FROM orders WHERE id = 3456

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('1893.53'),)]

My effort above is not very good... There's no sorting of the numbers, and no averaging of the two middle values

In [22]:
%%sql
SELECT *
FROM (SELECT total_amt_usd
      FROM orders
      ORDER BY total_amt_usd
      LIMIT 3457) AS Table1
ORDER BY total_amt_usd DESC
LIMIT 2;

 * postgresql://localhost/parchposey
2 rows affected.

[(Decimal('2483.16'),), (Decimal('2482.55'),)]

The subquery above sorts the numbers first. It then returns the 2 middle values 3456 and 3457. It's then up to us to divide by two... or we could do this:

In [23]:
%%sql
SELECT AVG(total_amt_usd) FROM
	(SELECT *
		FROM (SELECT total_amt_usd
      		FROM orders
      		ORDER BY total_amt_usd
      		LIMIT 3457) AS Table1
	ORDER BY total_amt_usd DESC
	LIMIT 2) AS Table2

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('2482.8550000000000000'),)]

## Concept 14. Quiz: GROUP BY

1. Which account (by name) placed the earliest order? Your solution should have the account name and the date of the order.

In [24]:
%%sql
SELECT a.name, o.occurred_at
FROM accounts a
JOIN orders o
ON o.account_id = a.id
ORDER BY o.occurred_at
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[('DISH Network', datetime.datetime(2013, 12, 4, 4, 22, 44))]

2. Find the total sales in usd for each account. You should include two columns - the total sales for each company's orders in usd and the company name.

In [25]:
%%sql
SELECT a.name,
    SUM(o.total_amt_usd)
FROM accounts a
JOIN orders o
ON o.account_id = a.id
GROUP BY a.name
ORDER BY a.name

 * postgresql://localhost/parchposey
350 rows affected.

[('3M', Decimal('127945.10')),
 ('Abbott Laboratories', Decimal('96819.92')),
 ('AbbVie', Decimal('11243.63')),
 ('ADP', Decimal('163579.18')),
 ('Advance Auto Parts', Decimal('6962.07'))]

3. Via what channel did the most recent (latest) web_event occur, which account was associated with this web_event? Your query should return only three values - the date, channel, and account name.

In [26]:
%%sql
SELECT w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
ORDER BY w.occurred_at DESC 
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[(datetime.datetime(2017, 1, 1, 23, 51, 9), 'organic', 'Molina Healthcare')]

4. Find the total number of times each type of channel from the web_events was used. Your final table should have two columns - the channel and the number of times the channel was used.

In [27]:
%%sql
SELECT w.channel, COUNT(*)
FROM web_events w
GROUP BY w.channel

 * postgresql://localhost/parchposey
6 rows affected.

[('twitter', 474),
 ('adwords', 906),
 ('organic', 952),
 ('banner', 476),
 ('facebook', 967)]

5. Who was the primary contact associated with the earliest web_event?

In [28]:
%%sql
SELECT a.primary_poc
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
ORDER BY w.occurred_at 
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[('Leana Hawker',)]

6. What was the smallest order placed by each account in terms of total usd. Provide only two columns - the account name and the total usd. Order from smallest dollar amounts to largest.

In [29]:
%%sql
SELECT a.name, MIN(o.total_amt_usd) smallest_order
FROM orders o
JOIN accounts o
ON o.account_id = a.id
GROUP BY a.name
ORDER BY smallest_order

 * postgresql://localhost/parchposey
(psycopg2.errors.DuplicateAlias) table name "o" specified more than once

[SQL: SELECT a.name, MIN(o.total_amt_usd) smallest_order
FROM orders o
JOIN accounts o
ON o.account_id = a.id
GROUP BY a.name
ORDER BY smallest_order]
(Background on this error at: https://sqlalche.me/e/14/f405)

7. Find the number of sales reps in each region. Your final table should have two columns - the region and the number of sales_reps. Order from fewest reps to most reps.

In [30]:
%%sql
SELECT r.name region_name, COUNT(*) number_of_reps
FROM region r
JOIN sales_reps s
ON r.id = s.region_id
GROUP BY region_name
ORDER BY number_of_reps

 * postgresql://localhost/parchposey
4 rows affected.

[('Midwest', 9), ('Southeast', 10), ('West', 10), ('Northeast', 21)]

## Concept 17. Quiz: GROUP BY Part II

1. For each account, determine the average amount of each type of paper they purchased across their orders. Your result should have four columns - one for the account name and one for the average quantity purchased for each of the paper types for each account.

In [31]:
%%sql
SELECT a.name, AVG(standard_qty), AVG(poster_qty), AVG(gloss_qty)
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY a.name
ORDER BY a.name

 * postgresql://localhost/parchposey
350 rows affected.

[('3M', Decimal('313.3928571428571429'), Decimal('112.1071428571428571'), Decimal('279.7500000000000000')),
 ('Abbott Laboratories', Decimal('201.1000000000000000'), Decimal('92.4333333333333333'), Decimal('196.7000000000000000')),
 ('AbbVie', Decimal('238.3333333333333333'), Decimal('58.6666666666666667'), Decimal('278.0000000000000000')),
 ('ADP', Decimal('354.6333333333333333'), Decimal('61.9833333333333333'), Decimal('60.5333333333333333')),
 ('Advance Auto Parts', Decimal('274.0000000000000000'), Decimal('27.7500000000000000'), Decimal('19.7500000000000000'))]

2. For each account, determine the average amount spent per order on each paper type. Your result should have four columns - one for the account name and one for the average amount spent on each paper type.

In [32]:
%%sql
SELECT a.name, AVG(standard_amt_usd), AVG(poster_amt_usd), AVG(gloss_amt_usd)
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY a.name
ORDER BY a.name

 * postgresql://localhost/parchposey
350 rows affected.

[('3M', Decimal('1563.8303571428571429'), Decimal('910.3100000000000000'), Decimal('2095.3275000000000000')),
 ('Abbott Laboratories', Decimal('1003.4890000000000000'), Decimal('750.5586666666666667'), Decimal('1473.2830000000000000')),
 ('AbbVie', Decimal('1189.2833333333333333'), Decimal('476.3733333333333333'), Decimal('2082.2200000000000000')),
 ('ADP', Decimal('1769.6203333333333333'), Decimal('503.3046666666666667'), Decimal('453.3946666666666667')),
 ('Advance Auto Parts', Decimal('1367.2600000000000000'), Decimal('225.3300000000000000'), Decimal('147.9275000000000000'))]

3. Determine the number of times a particular channel was used in the web_events table for each sales rep. Your final table should have three columns - the name of the sales rep, the channel, and the number of occurrences. Order your table with the highest number of occurrences first.

In [33]:
%%sql
SELECT s.name, w.channel, COUNT(*) num
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
JOIN sales_reps s
ON a.sales_rep_id = s.id
GROUP BY s.name, w.channel
ORDER BY num DESC

 * postgresql://localhost/parchposey
295 rows affected.

[('Earlie Schleusner', 'direct', 234),
 ('Vernita Plump', 'direct', 232),
 ('Moon Torian', 'direct', 194),
 ('Georgianna Chisholm', 'direct', 188),
 ('Tia Amato', 'direct', 185)]

4. Determine the number of times a particular channel was used in the web_events table for each region. Your final table should have three columns - the region name, the channel, and the number of occurrences. Order your table with the highest number of occurrences first.

In [34]:
%%sql
SELECT r.name, w.channel, COUNT(*) num
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id
GROUP BY r.name, w.channel
ORDER BY num DESC

 * postgresql://localhost/parchposey
24 rows affected.

[('Northeast', 'direct', 1800),
 ('Southeast', 'direct', 1548),
 ('West', 'direct', 1254),
 ('Midwest', 'direct', 696),
 ('Northeast', 'facebook', 335)]

## Concept 20. Quiz: DISTINCT

1. Use DISTINCT to test if there are any accounts associated with more than one region.

In [35]:
%%sql
SELECT a.name, s.region_id FROM accounts a
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON r.id = s.region_id

 * postgresql://localhost/parchposey
351 rows affected.

[('Johnson Controls', 1),
 ('American Airlines Group', 1),
 ('Ingram Micro', 1),
 ('Freddie Mac', 1),
 ('Express Scripts Holding', 1)]

The above produces the same number of results as the following. This indicates that there are no accounts with multiple regions

In [36]:
%%sql
SELECT DISTINCT id, name
FROM accounts;

 * postgresql://localhost/parchposey
351 rows affected.

[(1591, 'Lockheed Martin'),
 (2701, 'PNC Financial Services Group'),
 (2451, 'Starbucks'),
 (1681, 'Nationwide'),
 (4111, 'Republic Services')]

2. Have any sales reps worked on more than one account?

In [37]:
%%sql
SELECT DISTINCT id, name FROM sales_reps

 * postgresql://localhost/parchposey
50 rows affected.

[(321870, 'Derrick Boggess'),
 (321500, 'Samuel Racine'),
 (321580, 'Sibyl Lauria'),
 (321550, 'Lavera Oles'),
 (321860, 'Saran Ram')]

-- There are 50 sales reps. Using DISTINCT in this first query does seem pretty pointless, but it does point out that a sales rep isn't duplicated.

In [38]:
%%sql
SELECT a.name account_name, s.name rep_name FROM accounts a
JOIN sales_reps s
ON a.sales_rep_id = s.id
ORDER BY rep_name

 * postgresql://localhost/parchposey
351 rows affected.

[('FedEx', 'Akilah Drinkard'),
 ('Comcast', 'Akilah Drinkard'),
 ('Fannie Mae', 'Akilah Drinkard'),
 ('Assurant', 'Arica Stoltzfus'),
 ('W.W. Grainger', 'Arica Stoltzfus')]

-- Here we listed all accounts and associated sales reps. We can easily see there are reps with more than one account

In [39]:
%%sql
SELECT s.id, s.name, COUNT(*) num_accounts
FROM accounts a
JOIN sales_reps s
ON s.id = a.sales_rep_id
GROUP BY s.id, s.name
ORDER BY num_accounts;

 * postgresql://localhost/parchposey
50 rows affected.

[(321620, 'Retha Sears', 3),
 (321600, 'Ernestine Pickron', 3),
 (321650, 'Akilah Drinkard', 3),
 (321660, 'Silvana Virden', 3),
 (321610, 'Ayesha Monica', 3)]

Here we've counted the number of accounts for each customer. Which proves the point above a bit more cleanly. It doesn't really utilise the DISTINCT clause though... (which is a good thing as it is sloooowwww)

## Concept 23. HAVING

1. How many of the sales reps have more than 5 accounts that they manage?

In [40]:
%%sql
SELECT s.id, s.name, COUNT(*) num_accounts
FROM accounts a
JOIN sales_reps s
ON s.id = a.sales_rep_id
GROUP BY s.id, s.name
HAVING COUNT(*) > 5
ORDER BY num_accounts

 * postgresql://localhost/parchposey
34 rows affected.

[(321500, 'Samuel Racine', 6),
 (321510, 'Eugena Esser', 6),
 (321580, 'Sibyl Lauria', 6),
 (321590, 'Necole Victory', 6),
 (321560, 'Elba Felder', 6)]

2. How many accounts have more than 20 orders?

In [41]:
%%sql
SELECT a.name, COUNT(*) num_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
HAVING COUNT(*) > 20
ORDER BY num_orders

 * postgresql://localhost/parchposey
120 rows affected.

[('Thrivent Financial for Lutherans', 21),
 ('Performance Food Group', 21),
 ('Anthem', 21),
 ('Raytheon', 22),
 ('Jabil Circuit', 22)]

3. Which account has the most orders?

In [42]:
%%sql
SELECT a.name, COUNT(*) num_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
ORDER BY num_orders DESC
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[('Leucadia National', 71)]

4. Which accounts spent more than 30,000 usd total across all orders?

In [43]:
%%sql
SELECT a.name, SUM(total_amt_usd) sum_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
HAVING SUM(total_amt_usd) > 30000

 * postgresql://localhost/parchposey
204 rows affected.

[('Monsanto', Decimal('130964.11')),
 ('KKR', Decimal('217473.85')),
 ('Performance Food Group', Decimal('47645.86')),
 ('Paccar', Decimal('161294.62')),
 ('USAA', Decimal('46822.63'))]

5. Which accounts spent less than 1,000 usd total across all orders?

In [44]:
%%sql
SELECT a.name, SUM(total_amt_usd) sum_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
HAVING SUM(total_amt_usd) < 10000

 * postgresql://localhost/parchposey
56 rows affected.

[('AIG', Decimal('9980.93')),
 ('W.W. Grainger', Decimal('8384.61')),
 ('Deere', Decimal('1036.57')),
 ('General Motors', Decimal('9995.05')),
 ('Universal Health Services', Decimal('5269.51'))]

6. Which account has spent the most with us?

In [45]:
%%sql
SELECT a.name, SUM(total_amt_usd) sum_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
ORDER BY sum_orders DESC
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[('EOG Resources', Decimal('382873.30'))]

7. Which account has spent the least with us?

In [46]:
%%sql
SELECT a.name, SUM(total_amt_usd) sum_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
ORDER BY sum_orders
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[('Nike', Decimal('390.25'))]

8. Which accounts used facebook as a channel to contact customers more than 6 times?

In [47]:
%%sql
SELECT a.name, w.channel, COUNT(*) num
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
WHERE w.channel = 'facebook'
GROUP BY a.name, w.channel
HAVING COUNT(*) > 6
ORDER BY a.name

 * postgresql://localhost/parchposey
46 rows affected.

[('ADP', 'facebook', 9),
 ('Aetna', 'facebook', 10),
 ('Apple', 'facebook', 9),
 ('Arrow Electronics', 'facebook', 9),
 ('AutoNation', 'facebook', 14)]

9. Which account used facebook most as a channel?

In [48]:
%%sql
SELECT a.name, w.channel, COUNT(*) num
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
WHERE w.channel = 'facebook'
GROUP BY a.name, w.channel
ORDER BY num DESC
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[('Gilead Sciences', 'facebook', 16)]

... but this wouldn't have worked well if more than one account had used a particular channel the same number of times. Best to use LIMIT 3 or so

10. Which channel was most frequently used by most accounts?

In [49]:
%%sql
SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
GROUP BY a.id, a.name, w.channel
ORDER BY use_of_channel DESC
LIMIT 10;

 * postgresql://localhost/parchposey
10 rows affected.

[(3411, 'Leucadia National', 'direct', 52),
 (2731, 'Colgate-Palmolive', 'direct', 51),
 (1601, 'New York Life Insurance', 'direct', 51),
 (2051, 'Philip Morris International', 'direct', 49),
 (3911, 'Charter Communications', 'direct', 48)]

I did not get this result. I went off on a complicated tangent including a subquery. I supposed that the question is more complex that it needs to be: if you simply view the web_events with the highest occurence (grouped by id>name>channel) you'll see the top ten at least are "direct" which answers the question ... or does it?!

## Concept 27. Quiz: DATE Functions

Find the sales in terms of total dollars for all orders in each year, ordered from greatest to least. Do you notice any trends in the yearly sales totals?

In [50]:
%%sql
SELECT
    DATE_TRUNC('year',occurred_at) year_total,
	SUM(total_amt_usd) sum_total_amt_usd
FROM orders
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0), Decimal('12864917.92')),
 (datetime.datetime(2015, 1, 1, 0, 0), Decimal('5752004.94')),
 (datetime.datetime(2014, 1, 1, 0, 0), Decimal('4069106.54')),
 (datetime.datetime(2013, 1, 1, 0, 0), Decimal('377331.00')),
 (datetime.datetime(2017, 1, 1, 0, 0), Decimal('78151.43'))]

Which month did Parch & Posey have the greatest sales in terms of total dollars? Are all months evenly represented by the dataset?

In [51]:
%%sql
SELECT
    DATE_TRUNC('month',occurred_at) year_total,
	SUM(total_amt_usd) sum_total_amt_usd
FROM orders
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
38 rows affected.

[(datetime.datetime(2016, 12, 1, 0, 0), Decimal('1770282.62')),
 (datetime.datetime(2016, 11, 1, 0, 0), Decimal('1396045.62')),
 (datetime.datetime(2016, 10, 1, 0, 0), Decimal('1377981.57')),
 (datetime.datetime(2016, 7, 1, 0, 0), Decimal('1227707.47')),
 (datetime.datetime(2016, 9, 1, 0, 0), Decimal('1206399.93'))]

Which year did Parch & Posey have the greatest sales in terms of total number of orders? Are all years evenly represented by the dataset?

In [52]:
%%sql
SELECT
    DATE_TRUNC('year',occurred_at) year_total,
	COUNT(*) num_orders
FROM orders
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0), 3757),
 (datetime.datetime(2015, 1, 1, 0, 0), 1725),
 (datetime.datetime(2014, 1, 1, 0, 0), 1306),
 (datetime.datetime(2013, 1, 1, 0, 0), 99),
 (datetime.datetime(2017, 1, 1, 0, 0), 25)]

Which month did Parch & Posey have the greatest sales in terms of total number of orders? Are all months evenly represented by the dataset?

In [53]:
%%sql
SELECT
    DATE_TRUNC('months',occurred_at) year_total,
	COUNT(*) num_orders
FROM orders
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
38 rows affected.

[(datetime.datetime(2016, 12, 1, 0, 0), 463),
 (datetime.datetime(2016, 11, 1, 0, 0), 425),
 (datetime.datetime(2016, 10, 1, 0, 0), 389),
 (datetime.datetime(2016, 9, 1, 0, 0), 350),
 (datetime.datetime(2016, 8, 1, 0, 0), 341)]

In which month of which year did Walmart spend the most on gloss paper in terms of dollars?

In [54]:
%%sql
SELECT DATE_TRUNC('month', o.occurred_at) ord_date, SUM(o.gloss_amt_usd) tot_spent
FROM orders o 
JOIN accounts a
ON a.id = o.account_id
WHERE a.name = 'Walmart'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * postgresql://localhost/parchposey
1 rows affected.

[(datetime.datetime(2016, 5, 1, 0, 0), Decimal('9257.64'))]

Again, I made this much more complicated than it needed to be: all we needed to do was compute a list of all months detailing Walmart's spend on gloss paper. Sort descending. Limit 1. Done.

Note: DATE_TRUNC does not truncate anything to the left of the specified time unit, so the year remains.

## Concept 31. Quiz: CASE

Write a query to display for each order, the account ID, total amount of the order, and the level of the order - Large or Small - depending on if the order is $3000 or more, or smaller than $3000.

In [55]:
%%sql
SELECT o.account_id, o.total_amt_usd,
    CASE WHEN o.total_amt_usd >= 3000 THEN 'Large' ELSE 'Small' END AS order_level
FROM orders o

 * postgresql://localhost/parchposey
6912 rows affected.

[(1001, Decimal('973.43'), 'Small'),
 (1001, Decimal('1718.03'), 'Small'),
 (1001, Decimal('776.18'), 'Small'),
 (1001, Decimal('958.24'), 'Small'),
 (1001, Decimal('983.49'), 'Small')]

Write a query to display the number of orders in each of three categories, based on the total number of items in each order. The three categories are: 'At Least 2000', 'Between 1000 and 2000' and 'Less than 1000'.

In [56]:
%%sql
SELECT 
    CASE
        WHEN o.total_amt_usd >= 2000 THEN 'At Least 2000'
        WHEN o.total_amt_usd < 2000 AND o.total_amt_usd >= 1000 THEN 'Between 1000 and 2000'
        ELSE 'Less than 1000' END AS category,
    COUNT(*)
FROM orders o
GROUP BY 1

 * postgresql://localhost/parchposey
3 rows affected.

[('Less than 1000', 1270),
 ('At Least 2000', 4072),
 ('Between 1000 and 2000', 1570)]

We would like to understand 3 different levels of customers based on the amount associated with their purchases.

The top level includes anyone with a Lifetime Value (total sales of all orders) greater than 200,000 usd.

The second level is between 200,000 and 100,000 usd.

The lowest level is anyone under 100,000 usd.

Provide a table that includes the level associated with each account.

You should provide the account name, the total sales of all orders for the customer, and the level. Order with the top spending customers listed first.

In [57]:
%%sql
SELECT a.name, SUM(o.total_amt_usd),
    CASE
        WHEN SUM(o.total_amt_usd) > 200000 THEN 'Greater than 200,000 usd'
        WHEN SUM(o.total_amt_usd) <= 200000 AND SUM(o.total_amt_usd) >= 100000 THEN 'Between 200,000 and 100,000 usd'
        ELSE 'Under 100,000 usd'
        END as level
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
350 rows affected.

[('EOG Resources', Decimal('382873.30'), 'Greater than 200,000 usd'),
 ('Mosaic', Decimal('345618.59'), 'Greater than 200,000 usd'),
 ('IBM', Decimal('326819.48'), 'Greater than 200,000 usd'),
 ('General Dynamics', Decimal('300694.79'), 'Greater than 200,000 usd'),
 ('Republic Services', Decimal('293861.14'), 'Greater than 200,000 usd')]

We would now like to perform a similar calculation to the first, but we want to obtain the total amount spent by customers only in 2016 and 2017. Keep the same levels as in the previous question. Order with the top spending customers listed first.

In [58]:
%%sql
SELECT a.name, SUM(o.total_amt_usd),
    CASE
        WHEN SUM(o.total_amt_usd) > 200000 THEN 'Greater than 200,000 usd'
        WHEN SUM(o.total_amt_usd) <= 200000 AND SUM(o.total_amt_usd) >= 100000 THEN 'Between 200,000 and 100,000 usd'
        ELSE 'Under 100,000 usd'
        END AS level
FROM orders o
JOIN accounts a
ON o.account_id = a.id
WHERE o.occurred_at BETWEEN '2016-01-01' AND '2018-01-01'
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
322 rows affected.

[('Pacific Life', Decimal('255319.18'), 'Greater than 200,000 usd'),
 ('Mosaic', Decimal('172180.04'), 'Between 200,000 and 100,000 usd'),
 ('CHS', Decimal('163471.78'), 'Between 200,000 and 100,000 usd'),
 ('Core-Mark Holding', Decimal('148105.93'), 'Between 200,000 and 100,000 usd'),
 ('Disney', Decimal('129157.38'), 'Between 200,000 and 100,000 usd')]

We would like to identify top performing sales reps, which are sales reps associated with more than 200 orders. Create a table with the sales rep name, the total number of orders, and a column with top or not depending on if they have more than 200 orders. Place the top sales people first in your final table.

- Columns required: rep_name, num_orders, top
- Group by: rep_name
- Order by order_count (descending)

In [59]:
%%sql
SELECT s.name rep_name, COUNT(o.*) num_orders,
    CASE
        WHEN COUNT(o.*) > 200 THEN 'top'
        ELSE 'not'
        END AS top_not
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
50 rows affected.

[('Earlie Schleusner', 335, 'top'),
 ('Vernita Plump', 299, 'top'),
 ('Tia Amato', 267, 'top'),
 ('Georgianna Chisholm', 256, 'top'),
 ('Moon Torian', 250, 'top')]

The previous didn't account for the middle, nor the dollar amount associated with the sales. Management decides they want to see these characteristics represented as well.

We would like to identify top performing sales reps, which are sales reps associated with more than 200 orders or more than 750000 in total sales.

The middle group has any rep with more than 150 orders or 500000 in sales.

Create a table with:
- the sales rep name
- the total number of orders
- total sales across all orders
- a column with top, middle, or low depending on this criteria.

Place the top sales people based on dollar amount of sales first in your final table.

You might see a few upset sales people by this criteria!

In [60]:
%%sql
SELECT s.name rep_name, COUNT(o.*) num_orders, SUM(o.total_amt_usd) total_sales,
    CASE
        WHEN COUNT(o.*) > 200 OR SUM(o.total_amt_usd) > 750000 THEN 'top'
        WHEN
            (COUNT(o.*) <= 200 AND COUNT(o.*) > 150)
            OR
            (SUM(o.total_amt_usd) <= 750000 AND SUM(o.total_amt_usd) > 500000) THEN 'middle'
        ELSE 'not'
        END AS top_not
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
GROUP BY 1
ORDER BY 3 DESC

 * postgresql://localhost/parchposey
50 rows affected.

[('Earlie Schleusner', 335, Decimal('1098137.72'), 'top'),
 ('Tia Amato', 267, Decimal('1010690.60'), 'top'),
 ('Vernita Plump', 299, Decimal('934212.93'), 'top'),
 ('Georgianna Chisholm', 256, Decimal('886244.12'), 'top'),
 ('Arica Stoltzfus', 186, Decimal('810353.34'), 'top')]

We want to find the average number of events for each day for each channel. The first table will provide us the number of events for each day and channel, and then we will need to average these values together using a second query.

An attempt to abstract the wordy description into a framework which simplifies the production of an SQL statement:

* Time period: day
* Output: number of events during time period
* Group by: channel, day

In [61]:
%%sql
SELECT channel,
    AVG(channel_count) avg_channel_count
FROM
(SELECT DATE_TRUNC('day', w.occurred_at),
    w.channel,
    COUNT(*) channel_count
FROM web_events w
GROUP BY 1,2
ORDER BY 1) sub
GROUP BY 1
ORDER BY 1

 * postgresql://localhost/parchposey
6 rows affected.

[('adwords', Decimal('1.5701906412478336')),
 ('banner', Decimal('1.2899728997289973')),
 ('direct', Decimal('4.8964879852125693')),
 ('facebook', Decimal('1.5983471074380165')),
 ('organic', Decimal('1.6672504378283713'))]

First month an order was placed?

In [62]:
%%sql
SELECT DATE_TRUNC('month', MIN(occurred_at)) FROM orders

 * postgresql://localhost/parchposey
1 rows affected.

[(datetime.datetime(2013, 12, 1, 0, 0),)]

The average amount of standard paper sold on the first month that any order was placed in the orders table (in terms of quantity).

The average amount of gloss paper sold on the first month that any order was placed in the orders table (in terms of quantity).

The average amount of poster paper sold on the first month that any order was placed in the orders table (in terms of quantity).

The total amount spent on all orders on the first month that any order was placed in the orders table (in terms of usd).

In [63]:
%%sql
SELECT
    AVG(standard_qty) avg_standard,
    AVG(gloss_qty) avg_gloss,
    AVG(poster_qty) avg_poster
    SUM(total_amt_usd) total_usd
FROM orders
WHERE DATE_TRUNC('month', occurred_at) = 
(SELECT DATE_TRUNC('month', MIN(occurred_at)) AS min_month FROM orders)

 * postgresql://localhost/parchposey
(psycopg2.errors.SyntaxError) syntax error at or near "SUM"
LINE 5:     SUM(total_amt_usd) total_usd
            ^

[SQL: SELECT
    AVG(standard_qty) avg_standard,
    AVG(gloss_qty) avg_gloss,
    AVG(poster_qty) avg_poster
    SUM(total_amt_usd) total_usd
FROM orders
WHERE DATE_TRUNC('month', occurred_at) =
(SELECT DATE_TRUNC('month', MIN(occurred_at)) AS min_month FROM orders)]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Lesson 4. Concept 9. Quiz: Subquery Mania

> __I PUT A LOT OF TIME INTO THESE NOTES!!!!!!!!__

Provide the name of the sales_rep in each region with the largest amount of total_amt_usd sales.

 - Group by: Region
 - Return: Sales rep
 - Filter by: MAX(total_amt_usd) <<==== THIS IS A CLUE: "FILTER" MIGHT SUGGEST USING JOIN

 - SUM(total_amt_usd) by sales rep by region

Or

- Calculate the SUM(total_amt_usd) for each sales rep.
- Find the maximum for each region
- List that max and the sales rep for each region <<==== THIS IS A CLUE: COMBINING MIGHT SUGGEST USING JOIN

Problem 1: what if two sales reps have sold the same max amount in any region?

Problem 2: Care must be taken to ensure that sales reps with same value sales in different regions aren't bulked together

My effort:

In [64]:
%%sql
SELECT s.name sales_rep, r.name region_name, SUM(total_amt_usd) total_sales
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id
GROUP BY 1, 2
ORDER BY 3 DESC

 * postgresql://localhost/parchposey
50 rows affected.

[('Earlie Schleusner', 'Southeast', Decimal('1098137.72')),
 ('Tia Amato', 'Northeast', Decimal('1010690.60')),
 ('Vernita Plump', 'Southeast', Decimal('934212.93')),
 ('Georgianna Chisholm', 'West', Decimal('886244.12')),
 ('Arica Stoltzfus', 'West', Decimal('810353.34'))]

Developed slightly with a clue from the solution

In [65]:
%%sql
SELECT region_name, MAX(total_sales)
FROM (
    SELECT s.name sales_rep, r.name region_name, SUM(total_amt_usd) total_sales
    FROM orders o
    JOIN accounts a
    ON o.account_id = a.id
    JOIN sales_reps s
    ON a.sales_rep_id = s.id
    JOIN region r
    ON s.region_id = r.id
    GROUP BY 1, 2
    ORDER BY 3 DESC
) AS Table1
GROUP BY 1

 * postgresql://localhost/parchposey
4 rows affected.

[('Midwest', Decimal('675637.19')),
 ('Southeast', Decimal('1098137.72')),
 ('West', Decimal('886244.12')),
 ('Northeast', Decimal('1010690.60'))]

But I didn't get far enough. The solution is shown below.

I kept thinking about how to create a query that would return a table with just the maximum value from each region (I had in mind the use of TRIM) but actually this method is much more straightforward: join the two tables above together.

It occured to me that there's loads of repetition going on (in terms of joins etc) but this evidently don't matter.

Breakdown:
1. Calculate the sum of each agents sales within each region. This can be done by grouping by region, agent, with aggregate sum(total_amt_usd). Call this table t1

2. Identify the max agent's sum(total_amt_usd) from t1. Call this table t2.

3. Join tables t2 and t1 together. Without using a WITH clause, you need to create a third table to do this. Join these tables on t2.region_name = t3.region_name AND t2.max_region_sum_total_amt_usd = t3.rep_sum_total_amt_usd. This bit is the magic: by matching the t3.total_amt (all agent's totals)= t2.total_amt (which is the max), we create a table which only lists those agents with the max sales per region.

In [66]:
%%sql
SELECT t2.region_name, t3.sales_rep_name, t3.sum_total_amt_usd
FROM (
    SELECT region_name, MAX(sum_total_amt_usd) max_region_sum_total_amt_usd
    FROM (
        -- Calculates total sales for each agent in each region
        SELECT r.name region_name, s.name sales_rep_name, SUM(total_amt_usd) sum_total_amt_usd
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        JOIN sales_reps s
        ON a.sales_rep_id = s.id
        JOIN region r
        ON s.region_id = r.id
        GROUP BY 1, 2
        ORDER BY 1
        ) AS t1
    GROUP BY 1
    ORDER BY 1) as t2
JOIN (
    -- Calculates total sales for each agent in each region. Identical to t1!
    SELECT r.name region_name, s.name sales_rep_name, SUM(total_amt_usd) sum_total_amt_usd
    FROM orders o
    JOIN accounts a
    ON o.account_id = a.id
    JOIN sales_reps s
    ON a.sales_rep_id = s.id
    JOIN region r
    ON s.region_id = r.id
    GROUP BY 2, 1
    ORDER BY 1
) AS t3
ON t2.region_name = t3.region_name AND t2.max_region_sum_total_amt_usd = t3.sum_total_amt_usd
ORDER BY 1

 * postgresql://localhost/parchposey
4 rows affected.

[('Midwest', 'Charles Bidwell', Decimal('675637.19')),
 ('Northeast', 'Tia Amato', Decimal('1010690.60')),
 ('Southeast', 'Earlie Schleusner', Decimal('1098137.72')),
 ('West', 'Georgianna Chisholm', Decimal('886244.12'))]

And the above can be further simplified using the WITH statement. Instead of identical subqueries which produce t1 and t3, we simply create/prepopulate a table t1 which contains the data we're interested in. This demonstrates how the creation of both t1 and t3 results in inefficiency as the tables are identical

In [67]:
%%sql
WITH t1 AS
    (
        -- Calculates total sales for each agent in each region
        SELECT r.name region_name, s.name sales_rep_name, SUM(total_amt_usd) sum_total_amt_usd
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        JOIN sales_reps s
        ON a.sales_rep_id = s.id
        JOIN region r
        ON s.region_id = r.id
        GROUP BY 1, 2
        ORDER BY 1
    )

SELECT t2.region_name, t1.sales_rep_name, t1.sum_total_amt_usd
FROM (
    SELECT region_name, MAX(sum_total_amt_usd) max_region_sum_total_amt_usd
    FROM t1
    GROUP BY 1
    ORDER BY 1) as t2
JOIN t1
ON t2.region_name = t1.region_name AND t2.max_region_sum_total_amt_usd = t1.sum_total_amt_usd
ORDER BY 1

 * postgresql://localhost/parchposey
4 rows affected.

[('Midwest', 'Charles Bidwell', Decimal('675637.19')),
 ('Northeast', 'Tia Amato', Decimal('1010690.60')),
 ('Southeast', 'Earlie Schleusner', Decimal('1098137.72')),
 ('West', 'Georgianna Chisholm', Decimal('886244.12'))]

And we can take it further (although this is simply easier to read, no less efficient because the omitted subquery was only run once anyway ):

In [68]:
%%sql
WITH t1 AS
    (
        -- Calculates total sales for each agent in each region
        SELECT r.name region_name, s.name sales_rep_name, SUM(total_amt_usd) sum_total_amt_usd
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        JOIN sales_reps s
        ON a.sales_rep_id = s.id
        JOIN region r
        ON s.region_id = r.id
        GROUP BY 1, 2
        ORDER BY 1
    ),
    
    t2 AS
    (
        -- Identify the max sales any single agent made in each region
        SELECT region_name, MAX(sum_total_amt_usd) max_region_sum_total_amt_usd
        FROM t1
        GROUP BY 1
        ORDER BY 1
    )

SELECT t2.region_name, t1.sales_rep_name, t1.sum_total_amt_usd
FROM t2
JOIN t1
ON t2.region_name = t1.region_name AND t2.max_region_sum_total_amt_usd = t1.sum_total_amt_usd
ORDER BY 1

 * postgresql://localhost/parchposey
4 rows affected.

[('Midwest', 'Charles Bidwell', Decimal('675637.19')),
 ('Northeast', 'Tia Amato', Decimal('1010690.60')),
 ('Southeast', 'Earlie Schleusner', Decimal('1098137.72')),
 ('West', 'Georgianna Chisholm', Decimal('886244.12'))]

For the region with the largest (sum) of sales total_amt_usd, how many total (count) orders were placed?

Breakdown:
1. Which region has the largest SUM(total_amt_usd)?
2. What is the COUNT(*) of orders for that region? We could join tables together here...

Approach:
1. Create a table (t1) listing region_name and SUM(total_amt_usd) region_total_sales
2. Create a table (t2) listing region_name and MAX(region_total_sales) from t1
3. Create a table (t3) listing all orders and COUNT() number_orders for region_name from t2. This might be t2 joined with another table (t4) listing all orders.

OR (having peeked at the solution):

2. Create a table (t2) listing solely a single value MAX(region_total_sales) from t1 (this is called a SCALAR SUBQUERY apparently)
3. Create a table listing regions and a count of all orders for each.
4. Add a HAVING statement to list only the entry which has the same value as returned by step 2

In [69]:
%%sql
SELECT r.name region_name, COUNT(*) sales_count
FROM orders o
JOIN accounts a
ON o.account_id = a.id
JOIN sales_reps s
ON a.sales_rep_id = s.id
JOIN region r
ON s.region_id = r.id
GROUP BY 1
HAVING SUM(o.total_amt_usd) = (
    SELECT MAX(total_sales)
    FROM (
        SELECT r.name region_name, SUM(o.total_amt_usd) total_sales
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        JOIN sales_reps s
        ON a.sales_rep_id = s.id
        JOIN region r
        ON s.region_id = r.id
        GROUP BY 1) t1
)

 * postgresql://localhost/parchposey
1 rows affected.

[('Northeast', 2357)]

How many accounts had more total purchases than the account name which has bought the most standard_qty paper throughout their lifetime as a customer?

Breakdown
1. What is the most standard_qty paper purchased by any one account?
2. List total purchases by account: a.name, standard_qty + poster_qty + gloss_qty
3. Add HAVING clause SUM()

In [70]:
%%sql
SELECT a.name account_name, SUM(o.total) 
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
HAVING SUM(o.total) > (
    SELECT MAX(sum_standard_qty)
    FROM (
        SELECT a.name account_max_standard_qty, SUM(standard_qty) sum_standard_qty
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        GROUP BY 1
        ORDER BY 2 DESC
    ) t1
)
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
6 rows affected.

[('EOG Resources', 56410),
 ('Mosaic', 49246),
 ('IBM', 47506),
 ('Core-Mark Holding', 44750),
 ('General Dynamics', 43730)]

Not a bad attempt (above) but I made a couple of mistakes:
- In the HAVING clause, I selected the max value of sum_standard_qty. I should have selected the max value of sum_total (which would have needed to be added to t1's select clause). The way I have done it, any total quantities over the sum_standard_qty value would have been returned (which is not what the question asked for). Returning the total quantity for the account with the max standard qty is easy: just add SUM(o.total) to t1's select clause.

- Using MAX(total) (having included changes as per last point) results in the maximum value in the total column being returned, not the corresponding total value for the account with the max sum_standard_qty column. The solution here is to use LIMIT to restrict the returned rows. However, this doesn't feel like "best practice"...

- My approach simply returns the list of relevant account names (ie those with value of orders above a certain value). But the question asked for the number of accounts: so I should have added a COUNT clause over the whole query.

- Also, I didn't note that there's already a o.total value which suffices for standard_qty + gloss_qty etc

Corrected:

In [71]:
%%sql
SELECT COUNT(*) FROM (
    SELECT a.name account_name, SUM(o.total) 
    FROM orders o
    JOIN accounts a
    ON o.account_id = a.id
    GROUP BY 1
    HAVING SUM(o.total) > (
        SELECT total
        FROM (
            SELECT a.name account_max_standard_qty, SUM(standard_qty) sum_standard_qty, SUM(o.total) total
            FROM orders o
            JOIN accounts a
            ON o.account_id = a.id
            GROUP BY 1
            ORDER BY 2 DESC
            LIMIT 1
            ) t1
    )
    ORDER BY 2 DESC
) as t2

 * postgresql://localhost/parchposey
1 rows affected.

[(3,)]

Provided solution:

In [72]:
%%sql
SELECT COUNT(*)
FROM (SELECT a.name
       FROM orders o
       JOIN accounts a
       ON a.id = o.account_id
       GROUP BY 1
       HAVING SUM(o.total) > (SELECT total 
                   FROM (SELECT a.name act_name, SUM(o.standard_qty) tot_std, SUM(o.total) total
                         FROM accounts a
                         JOIN orders o
                         ON o.account_id = a.id
                         GROUP BY 1
                         ORDER BY 2 DESC
                         LIMIT 1) inner_tab)
             ) counter_tab;

 * postgresql://localhost/parchposey
1 rows affected.

[(3,)]

For the customer that spent the most (in total over their lifetime as a customer) total_amt_usd, how many web_events did they have for each channel?

Breakdown
1. Which customer spent the most? accounts, orders, web_events
2. How many web_events did they have? Group by channel

Desired derived table:

account_name    |   channel |   num_web_events

Specification:
WHERE account_name = *account_name which had spent the most*

In [73]:
%%sql
SELECT w.channel, COUNT(*)
FROM orders o
JOIN accounts a
ON a.id = o.account_id
JOIN web_events w
ON a.id = w.account_id
WHERE a.name = (
    SELECT account_name
    FROM (
        SELECT a.name account_name, SUM(o.total_amt_usd) total
        FROM orders o
        JOIN accounts a
        ON a.id = o.account_id
        JOIN web_events w
        ON a.id = w.account_id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 1
    ) AS t1
)
GROUP BY 1

 * postgresql://localhost/parchposey
6 rows affected.

[('adwords', 744),
 ('twitter', 310),
 ('organic', 806),
 ('banner', 248),
 ('facebook', 682)]

Again, another decent effort. However, I joined too many tables together, and this produced much larger numbers of rows, which in turn increased the count massively.

TAKE CARE ONLY TO JOIN ONLY NECESSARY TABLES

With some corrections:

In [74]:
%%sql
SELECT w.channel, COUNT(*)
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE a.name = ( -- I could have, instead, replaced WHERE with AND (which would have joined web_events and accounts on a.id = w.account_id AND a.name = *account name with greatest total_amt_usd)
    SELECT account_name
    FROM (
        SELECT a.name account_name, SUM(o.total_amt_usd) total
        FROM orders o
        JOIN accounts a
        ON a.id = o.account_id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 1
    ) AS t1
)
GROUP BY 1

 * postgresql://localhost/parchposey
6 rows affected.

[('adwords', 12),
 ('banner', 4),
 ('direct', 44),
 ('facebook', 11),
 ('organic', 13)]

Provided solution:

In [75]:
%%sql
SELECT a.name, w.channel, COUNT(*)
FROM accounts a
JOIN web_events w
ON a.id = w.account_id AND a.id =  (SELECT id
                     FROM (SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
                           FROM orders o
                           JOIN accounts a
                           ON a.id = o.account_id
                           GROUP BY a.id, a.name
                           ORDER BY 3 DESC
                           LIMIT 1) inner_table)
GROUP BY 1, 2
ORDER BY 3 DESC

 * postgresql://localhost/parchposey
6 rows affected.

[('EOG Resources', 'direct', 44),
 ('EOG Resources', 'organic', 13),
 ('EOG Resources', 'adwords', 12),
 ('EOG Resources', 'facebook', 11),
 ('EOG Resources', 'twitter', 5)]

The last line isn't really necessary

What is the lifetime average amount spent in terms of total_amt_usd for the top 10 total spending accounts?

Breakdown
1. What are top 10 total spending accounts?
2. What is the average of total_amt_usd of all orders for each of the above?

Desired derived table:
Join on o.account_id = a.id AND a.name = account_name (top 10 total spending accounts)

In [76]:
%%sql
SELECT account_id, AVG(total_amt_usd)
FROM orders o
JOIN (
    SELECT account_id account_id2, SUM(total_amt_usd)
    FROM orders o
    GROUP BY account_id
    ORDER BY 2 DESC
    LIMIT 10
) AS t1
ON t1.account_id2 = o.account_id
GROUP BY 1
ORDER BY 2 DESC

 * postgresql://localhost/parchposey
10 rows affected.

[(4211, Decimal('6175.3758064516129032')),
 (4111, Decimal('5877.2228000000000000')),
 (1301, Decimal('5446.9913333333333333')),
 (4151, Decimal('5236.6453030303030303')),
 (1871, Decimal('4555.9816666666666667'))]

Turns out I misinterpreted the question, or the question was badly worded...

To test my answer:

1. What's the ID of the account with the greatest spend?

In [77]:
%%sql
SELECT account_id account_id2, SUM(total_amt_usd)
FROM orders o
GROUP BY account_id
ORDER BY 2 DESC
LIMIT 1

 * postgresql://localhost/parchposey
1 rows affected.

[(4211, Decimal('382873.30'))]

Result: 4211

2. What's the average of total_amt_usd for this account_id?

In [78]:
%%sql
SELECT AVG(total_amt_usd)
FROM orders o
WHERE o.account_id = 4211

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('6175.3758064516129032'),)]

Result: 6175.3758064516129032 which matches the result so by my interpreation of the question my answer is correct

What is the lifetime average amount spent (in terms of total_amt_usd), including only the companies that spent more per order, on average, than the average of all orders.

Reword:
1. What is the average amount spent of only the companies whose average order was above the overall average?

Breakdown:
1. Calculate the overall average total_amt_usd of each order
2. Calculate the average total_amt_usd of each company
3. Produce a table which lists only the companies whose average total_amt_usd is greater than the overall average
4. Join this last table with a table which lists all orders, INNER JOIN on id, and take the average

In [79]:
%%sql
SELECT AVG(total_amt_usd)
FROM orders o
JOIN (
    SELECT account_id account_id2, AVG(total_amt_usd)
    FROM orders o
    GROUP BY 1
    HAVING AVG(total_amt_usd) > (
        SELECT AVG(total_amt_usd)
        FROM orders o
    )
    ORDER BY 1
) AS t1
ON t1.account_id2 = o.account_id

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('4434.2127982456140351'),)]

The provided solution came at this a little differently...

In [80]:
%%sql
SELECT AVG(avg_amt)
FROM (SELECT o.account_id, AVG(o.total_amt_usd) avg_amt
    FROM orders o
    GROUP BY 1
    HAVING AVG(o.total_amt_usd) > (SELECT AVG(o.total_amt_usd) avg_all
                                   FROM orders o)) temp_table;

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('4721.1397439971747168'),)]

Here it can be seen that it took the average of only the transactions above the overall average value. I interpreted the question differently: I identified companies whose average transaction was below overall average, and then calculated the average transaction for those identified companies.

## Concept 13. Quiz: WITH

Provide the name of the sales_rep in each region with the largest amount of total_amt_usd sales.

Use WITH

In [81]:
%%sql
WITH t3 AS
    (SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
    FROM sales_reps s
    JOIN accounts a
    ON a.sales_rep_id = s.id
    JOIN orders o
    ON o.account_id = a.id
    JOIN region r
    ON r.id = s.region_id
    GROUP BY 1,2),

    t2 AS
    (SELECT region_name, MAX(total_amt) total_amt
    FROM t3
    GROUP BY 1)

SELECT t3.rep_name, t3.region_name, t3.total_amt
FROM t2
JOIN t3
ON t3.region_name = t2.region_name AND t3.total_amt = t2.total_amt;

 * postgresql://localhost/parchposey
4 rows affected.

[('Charles Bidwell', 'Midwest', Decimal('675637.19')),
 ('Earlie Schleusner', 'Southeast', Decimal('1098137.72')),
 ('Georgianna Chisholm', 'West', Decimal('886244.12')),
 ('Tia Amato', 'Northeast', Decimal('1010690.60'))]

For the region with the largest sales total_amt_usd, how many total orders were placed?

Use WITH

Breakdown
1. Identify region with largest sales total_amt_usd
2. List all orders for that region
3. Count those orders

In [82]:
%%sql
WITH t1 AS
    (
        SELECT r.name region_name, SUM(total_amt_usd)
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        JOIN sales_reps s
        ON a.sales_rep_id = s.id
        JOIN region r
        ON s.region_id = r.id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 1
    ),

    t2 AS
    (
        SELECT o.id order_id, r.name region_name
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        JOIN sales_reps s
        ON a.sales_rep_id = s.id
        JOIN region r
        ON s.region_id = r.id
    )

SELECT t2.region_name, COUNT(*)
FROM t2
JOIN t1
ON t1.region_name = t2.region_name
GROUP BY 1

 * postgresql://localhost/parchposey
1 rows affected.

[('Northeast', 2357)]

How many accounts had more total purchases than the account name which has bought the most standard_qty paper throughout their lifetime as a customer?

Breakdown:
1. What account has bought the most standard_qty paper
2. How many accounts had more total purchases than this account?

Formalise:
1. Return: account_name, SUM(standard_qty), SUM(total)

Use WITH

In [83]:
%%sql
WITH
    t1 AS (
        SELECT a.name account_name, SUM(standard_qty) sum_standard_qty, SUM(total) sum_total
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 1
    ),

    t2 AS (
        SELECT a.name account_name, SUM(standard_qty) sum_standard_qty, SUM(total) sum_total
        FROM orders o
        JOIN accounts a
        ON o.account_id = a.id
        GROUP BY 1
        HAVING SUM(total) > (
            SELECT sum_total
            FROM t1
        )
    )

SELECT COUNT(*)
FROM t2

 * postgresql://localhost/parchposey
1 rows affected.

[(3,)]

For the customer that spent the most (in total over their lifetime as a customer) total_amt_usd, how many web_events did they have for each channel? 

Breakdown:
1. Which customer spent the most total_amt_usd?
2. How many web_events did they have for each channel?

Approaches:
1. Inner join between (which account_name spent the most total_amt_usd) and (all customer web_events grouped by channel) on (account_name)
2. Query (which account_name spent the most total_amt_usd) and specify in WHERE of (all customer web_events grouped by channel)

Approach 1, technique 1:
Here we join tables in a sequence

Perform inner join on tables t2 and t3. Common denominator will be the account name.
Feels very inefficient as we're creating a table of all web_events across all accounts.

Better to count web_events for each channel for only the account in question?

In [84]:
%%sql
WITH
    t1 AS (
        -- Identify the account with the greatest SUM(total_amt_usd)
        SELECT a.id, SUM(total_amt_usd) sum_total_amt_usd
        FROM orders o
        JOIN accounts a
        ON a.id = o.account_id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 1
    ),

    t2 AS (
        -- Pull the account name only
        SELECT id
        FROM t1
    ),

    t3 AS (
        -- Count number of rows in web_events grouped by account_name and channel
        SELECT a.id, w.channel, COUNT(*)
        FROM web_events w
        JOIN accounts a
        ON a.id = w.account_id
        GROUP BY 1, 2
    )

SELECT t3.id, t3.channel, t3.count
FROM t2
JOIN t3
ON t2.id = t3.id
ORDER BY 2

 * postgresql://localhost/parchposey
6 rows affected.

[(4211, 'adwords', 12),
 (4211, 'banner', 4),
 (4211, 'direct', 44),
 (4211, 'facebook', 11),
 (4211, 'organic', 13)]

Approach 1, technique 2 
Here we join two tables simultaneously.
Is this at all any more efficient than the previous operation?

In [85]:
%%sql
WITH
    t1 AS (
        -- Identify the account with the greatest SUM(total_amt_usd)
        SELECT a.id, SUM(total_amt_usd) sum_total_amt_usd
        FROM orders o
        JOIN accounts a
        ON a.id = o.account_id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 1
    )

SELECT a.name account_name, w.channel, COUNT(*)
FROM web_events w
JOIN accounts a
ON a.id = w.account_id AND a.id = (SELECT id FROM t1)
GROUP BY 1, 2

 * postgresql://localhost/parchposey
6 rows affected.

[('EOG Resources', 'adwords', 12),
 ('EOG Resources', 'banner', 4),
 ('EOG Resources', 'direct', 44),
 ('EOG Resources', 'facebook', 11),
 ('EOG Resources', 'organic', 13)]

Approach 2:
Syntactically these are almost identical... WHERE is kind of like ON??? Only in so far as INNER JOINS are concerned...

In [86]:
%%sql
WITH
t1 AS (
    -- Identify the account with the greatest SUM(total_amt_usd)
    SELECT a.id, SUM(total_amt_usd) sum_total_amt_usd
    FROM orders o
    JOIN accounts a
    ON a.id = o.account_id
    JOIN web_events w
    ON a.id = w.account_id
    GROUP BY 1
    ORDER BY 2 DESC
    LIMIT 1
)

SELECT a.name, w.channel, COUNT(*)
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
WHERE a.id = (SELECT id FROM t1)
GROUP BY 1, 2
ORDER BY 2

 * postgresql://localhost/parchposey
6 rows affected.

[('EOG Resources', 'adwords', 12),
 ('EOG Resources', 'banner', 4),
 ('EOG Resources', 'direct', 44),
 ('EOG Resources', 'facebook', 11),
 ('EOG Resources', 'organic', 13)]

What is the lifetime average amount spent in terms of total_amt_usd for the top 10 total spending accounts?

Use WITH

Breakdown:
1. What are the top 10 total spending accounts?
2. What is the average amount spent in terms of total_amt_usd across all of these accounts?

Approaches:
1. JOIN (top 10 accounts) with (list of all transactions) ON (account_id or name)
2. Calculate average of the above

In [87]:
%%sql
WITH
    top_10_accounts AS (
        SELECT a.id account_id, SUM(o.total_amt_usd) sum_total_amt_usd
        FROM accounts a
        JOIN orders o
        ON a.id = o.account_id
        GROUP BY 1
        ORDER BY 2 DESC
        LIMIT 10
    )

SELECT AVG(top_10_accounts.sum_total_amt_usd)
FROM top_10_accounts

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('304846.969000000000'),)]

What is the lifetime average amount spent in terms of total_amt_usd, including only the companies that spent more per order, on average, than the average of all orders.

Use WITH

Reword:
What's the overall average sum(total_amt_usd) of only companies with an avg(total_amt_usd) > overall avg(total_amt_usd)?

Approach
1. Calculate overall_avg_total_amt_usd
2. List companies with an avg(total_amt_usd) > overall_avg_total_amt_usd (companies_above_avg_total_amt_usd)
3. Calculate the average of these averages!

In [88]:
%%sql
WITH
    overall_avg_total_amt_usd AS
    (
        SELECT AVG(total_amt_usd)
        FROM orders
    ),

    companies_above_avg_total_amt_usd AS
    (
        SELECT a.id, AVG(o.total_amt_usd)
        FROM accounts a
        JOIN orders o
        ON a.id = o.account_id
        GROUP BY 1
        HAVING AVG(o.total_amt_usd) > (SELECT * FROM overall_avg_total_amt_usd)
    )

SELECT AVG(avg) FROM companies_above_avg_total_amt_usd

 * postgresql://localhost/parchposey
1 rows affected.

[(Decimal('4721.1397439971747168'),)]

Note on this line:

In [89]:
%%sql
HAVING AVG(o.total_amt_usd) > (SELECT * FROM overall_avg_total_amt_usd)

 * postgresql://localhost/parchposey
(psycopg2.errors.SyntaxError) syntax error at or near "HAVING"
LINE 1: HAVING AVG(o.total_amt_usd) > (SELECT * FROM overall_avg_tot...
        ^

[SQL: HAVING AVG(o.total_amt_usd) > (SELECT * FROM overall_avg_total_amt_usd)]
(Background on this error at: https://sqlalche.me/e/14/f405)

... it's not possible to reference directly the table overall_avg_total_amt_usd, even though it is a SCALAR QUERY.

## Lesson 5. Concept 3. Quiz: LEFT & RIGHT

Use the accounts table and a CASE statement to create two groups: one group of company names that start with a number and a second group of those company names that start with a letter. What proportion of company names start with a letter?

In [90]:
%%sql
SELECT 
	CASE
    	WHEN LEFT(name, 1) BETWEEN '0' AND '9' THEN 'Numerical'
        ELSE 'Not Numerical' END AS first_digit,
    COUNT(*)
FROM accounts
GROUP BY 1
ORDER BY 1

 * postgresql://localhost/parchposey
2 rows affected.

[('Not Numerical', 350), ('Numerical', 1)]

But how do we show the proportion of our results?

In [91]:
%%sql
WITH summary AS
    (
        SELECT 
            CASE
                WHEN LEFT(name, 1) BETWEEN '0' AND '9' THEN 'Numerical'
                ELSE 'Not Numerical' END AS first_digit,
            COUNT(*)
        FROM accounts
        GROUP BY 1
        ORDER BY 1
    )

SELECT first_digit, ROUND(count/(SELECT SUM(summary.count) FROM summary), 3) proportion
FROM summary

 * postgresql://localhost/parchposey
2 rows affected.

[('Not Numerical', Decimal('0.997')), ('Numerical', Decimal('0.003'))]

Consider vowels as a, e, i, o, and u. What proportion of company names start with a vowel, and what percent start with anything else?

In [92]:
%%sql
WITH summary AS
    (
        SELECT 
            CASE
                WHEN LEFT(name, 1) = 'A' OR LEFT(name, 1) = 'a' THEN 'a'
                WHEN LEFT(name, 1) = 'E' OR LEFT(name, 1) = 'e' THEN 'e'
                WHEN LEFT(name, 1) = 'I' OR LEFT(name, 1) = 'i' THEN 'i'
                WHEN LEFT(name, 1) = 'O' OR LEFT(name, 1) = 'o' THEN 'o'
                WHEN LEFT(name, 1) = 'U' OR LEFT(name, 1) = 'u' THEN 'u'
                ELSE '0 - other'
                END AS first_digit,
            COUNT(*)
        FROM accounts
        GROUP BY 1
        ORDER BY 1
    )

SELECT first_digit, ROUND(count/(SELECT SUM(summary.count) FROM summary), 3) proportion
FROM summary

 * postgresql://localhost/parchposey
6 rows affected.

[('0 - other', Decimal('0.772')),
 ('a', Decimal('0.105')),
 ('e', Decimal('0.046')),
 ('i', Decimal('0.020')),
 ('o', Decimal('0.020'))]

Could use LIKE instead

In [93]:
%%sql
WITH summary AS
    (
        SELECT 
            CASE
                WHEN name LIKE 'A%' OR name LIKE 'a%' THEN 'a'
                WHEN name LIKE 'E%' OR name LIKE 'e%' THEN 'e'
                WHEN name LIKE 'I%' OR name LIKE 'i%' THEN 'i'
                WHEN name LIKE 'O%' OR name LIKE 'o%' THEN 'o'
                WHEN name LIKE 'U%' OR name LIKE 'u%' THEN 'u'
                ELSE '0 - other'
                END AS first_digit,
            COUNT(*)
        FROM accounts
        GROUP BY 1
        ORDER BY 1
    )

SELECT first_digit, ROUND(count/(SELECT SUM(summary.count) FROM summary), 3) proportion
FROM summary

 * postgresql://localhost/parchposey
6 rows affected.

[('0 - other', Decimal('0.772')),
 ('a', Decimal('0.105')),
 ('e', Decimal('0.046')),
 ('i', Decimal('0.020')),
 ('o', Decimal('0.020'))]

Tidied up. When comparing strings, use UPPER()

In [94]:
%%sql
WITH summary AS
    (
        SELECT 
            CASE
                WHEN LEFT(UPPER(name), 1) = 'A' THEN 'a'
                WHEN LEFT(UPPER(name), 1) = 'E' THEN 'e'
                WHEN LEFT(UPPER(name), 1) = 'I' THEN 'i'
                WHEN LEFT(UPPER(name), 1) = 'O' THEN 'o'
                WHEN LEFT(UPPER(name), 1) = 'U' THEN 'u'
                ELSE '0 - other'
                END AS first_digit,
            COUNT(*)
        FROM accounts
        GROUP BY 1
        ORDER BY 1
    )

SELECT first_digit, ROUND(count/(SELECT SUM(summary.count) FROM summary), 3) proportion
FROM summary

 * postgresql://localhost/parchposey
6 rows affected.

[('0 - other', Decimal('0.772')),
 ('a', Decimal('0.105')),
 ('e', Decimal('0.046')),
 ('i', Decimal('0.020')),
 ('o', Decimal('0.020'))]

Being a bit more observant of the actual requested information, all we need is a delineation of vowels vs others:

In [95]:
%%sql
WITH summary AS
    (
        SELECT 
            CASE
                WHEN LEFT(UPPER(name), 1) IN ('A','E','I','O','U') THEN 'vowel'
                ELSE 'other'
                END AS first_digit,
            COUNT(*)
        FROM accounts
        GROUP BY 1
        ORDER BY 1
    )

SELECT first_digit, ROUND(count/(SELECT SUM(summary.count) FROM summary), 3) proportion
FROM summary

 * postgresql://localhost/parchposey
2 rows affected.

[('other', Decimal('0.772')), ('vowel', Decimal('0.228'))]

Another approach. This doesn't calculate the actual proportion though...

In [96]:
%%sql
WITH summary AS
    (
        SELECT name,
            CASE
                WHEN LEFT(UPPER(name), 1) IN ('A','E','I','O','U') THEN 1
                ELSE 0 END AS vowels, 
            CASE
                WHEN LEFT(UPPER(name), 1) IN ('A','E','I','O','U') THEN 0
                ELSE 1 END AS other
        FROM accounts
    )

SELECT SUM(vowels) vowels, SUM(other) other
FROM summary

 * postgresql://localhost/parchposey
1 rows affected.

[(80, 271)]

## Quizzes POSITION & STRPOS

Use the accounts table to create first and last name columns that hold the first and last names for the primary_poc.

In [97]:
%%sql
SELECT
	LEFT(primary_poc, POSITION(' ' IN UPPER(primary_poc))) AS first,
	RIGHT(primary_poc, LENGTH(primary_poc) - POSITION(' ' IN UPPER(primary_poc))) AS last
FROM accounts

 * postgresql://localhost/parchposey
351 rows affected.

[('Tamara ', 'Tuma'),
 ('Sung ', 'Shields'),
 ('Jodee ', 'Lupo'),
 ('Serafina ', 'Banda'),
 ('Angeles ', 'Crusoe')]

Now see if you can do the same thing for every rep name in the sales_reps table. Again provide first and last name columns.

In [98]:
%%sql
SELECT
	LEFT(name, POSITION(' ' IN UPPER(name))) AS first,
	RIGHT(name, LENGTH(name) - POSITION(' ' IN UPPER(name))) AS last
FROM sales_reps

 * postgresql://localhost/parchposey
50 rows affected.

[('Samuel ', 'Racine'),
 ('Eugena ', 'Esser'),
 ('Michel ', 'Averette'),
 ('Renetta ', 'Carew'),
 ('Cara ', 'Clarke')]

Correct given date "01/31/2014 08:00:00 AM +0000"

In [99]:
%%sql
SELECT
    date orig_date,
    (SUBSTR(date, 7, 4) || '-' || LEFT(date, 2) || '-' || SUBSTR(date, 4, 2))::DATE new_date
FROM sf_crime_data
LIMIT 10;

 * postgresql://localhost/parchposey
(psycopg2.errors.UndefinedTable) relation "sf_crime_data" does not exist
LINE 4: FROM sf_crime_data
             ^

[SQL: SELECT
    date orig_date,
    (SUBSTR(date, 7, 4) || '-' || LEFT(date, 2) || '-' || SUBSTR(date, 4, 2))::DATE new_date
FROM sf_crime_data
LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/f405)

## Coalesce

In [100]:
%%sql
SELECT
	COALESCE(o.id, a.id) filled_id,
    a.name,
    a.website,
    a.lat,
    a.long,
    a.primary_poc,
    a.sales_rep_id,
    COALESCE(o.account_id, a.id) account_id,
    o.occurred_at,
    COALESCE(o.standard_qty, 0) standard_qty,
    COALESCE(o.gloss_qty,0) gloss_qty,
    COALESCE(o.poster_qty,0) poster_qty,
    COALESCE(o.total,0) total,
    COALESCE(o.standard_amt_usd,0) standard_amt_usd,
    COALESCE(o.gloss_amt_usd,0) gloss_amt_usd,
    COALESCE(o.poster_amt_usd,0) poster_amt_usd,
    COALESCE(o.total_amt_usd,0) total_amt_usd
FROM accounts a
LEFT JOIN orders o
ON a.id = o.account_id
WHERE o.* IS NULL;

 * postgresql://localhost/parchposey
1 rows affected.

[(1731, 'Goldman Sachs Group', 'www.gs.com', Decimal('40.75744399'), Decimal('-73.96730918'), 'Loris Manfredi', 321690, 1731, None, 0, 0, 0, 0, Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'))]

## Window functions

In [101]:
%%sql
SELECT
	standard_amt_usd
    ,DATE_TRUNC('year', occurred_at) AS date_year -- <== QUITE NEAT PUTTING THE COMMA ON A NEW LINE. EDIT ONLY ONE LINE TO REMOVE A PARAMETER.
    ,SUM(standard_amt_usd) OVER (/* PARTITION BY DATE_TRUNC('year', occurred_at) */ ORDER BY occurred_at)
FROM orders

 * postgresql://localhost/parchposey
6912 rows affected.

[(Decimal('0.00'), datetime.datetime(2013, 1, 1, 0, 0), Decimal('0.00')),
 (Decimal('2445.10'), datetime.datetime(2013, 1, 1, 0, 0), Decimal('2445.10')),
 (Decimal('2634.72'), datetime.datetime(2013, 1, 1, 0, 0), Decimal('5079.82')),
 (Decimal('0.00'), datetime.datetime(2013, 1, 1, 0, 0), Decimal('5079.82')),
 (Decimal('2455.08'), datetime.datetime(2013, 1, 1, 0, 0), Decimal('7534.90'))]

Select the id, account_id, and total variable from the orders table, then create a column called total_rank that ranks this total amount of paper ordered (from highest to lowest) for each account using a partition. Your final table should have these four columns.

In [102]:
%%sql
SELECT
	id,
    ,account_id
    ,total
    ,DENSE_RANK() OVER (PARTITION BY account_id ORDER BY total) total_rank -- <== Provided solution suggests using RANK(), but I think DENSE_RANK() works better here
FROM orders

 * postgresql://localhost/parchposey
(psycopg2.errors.SyntaxError) syntax error at or near ","
LINE 3:     ,account_id
            ^

[SQL: SELECT
	id,
    ,account_id
    ,total
    ,DENSE_RANK() OVER (PARTITION BY account_id ORDER BY total) total_rank -- <== Provided solution suggests using RANK(), but I think DENSE_RANK() works better here
FROM orders]
(Background on this error at: https://sqlalche.me/e/14/f405)

Now, create and use an alias to shorten the following query (which is different than the one in Derek's previous video) that has multiple window functions. Name the alias account_year_window, which is more descriptive than main_window in the example above.

In [103]:
%%sql
SELECT id,
       account_id,
       DATE_TRUNC('year',occurred_at) AS year,
       DENSE_RANK() OVER (PARTITION BY account_id ORDER BY DATE_TRUNC('year',occurred_at)) AS dense_rank,
       total_amt_usd,
       SUM(total_amt_usd) OVER (PARTITION BY account_id ORDER BY DATE_TRUNC('year',occurred_at)) AS sum_total_amt_usd,
       COUNT(total_amt_usd) OVER (PARTITION BY account_id ORDER BY DATE_TRUNC('year',occurred_at)) AS count_total_amt_usd,
       AVG(total_amt_usd) OVER (PARTITION BY account_id ORDER BY DATE_TRUNC('year',occurred_at)) AS avg_total_amt_usd,
       MIN(total_amt_usd) OVER (PARTITION BY account_id ORDER BY DATE_TRUNC('year',occurred_at)) AS min_total_amt_usd,
       MAX(total_amt_usd) OVER (PARTITION BY account_id ORDER BY DATE_TRUNC('year',occurred_at)) AS max_total_amt_usd
FROM orders

 * postgresql://localhost/parchposey
6912 rows affected.

[(4307, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('8757.18'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (3, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('776.18'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (2, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('1718.03'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (1, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('973.43'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (4308, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('9426.71'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71'))]

My effort:

In [104]:
%%sql
SELECT 
    id
    ,account_id
    ,DATE_TRUNC('year',occurred_at) AS year
    ,DENSE_RANK() OVER account_year_window AS dense_rank
    ,total_amt_usd
    ,SUM(total_amt_usd) OVER account_year_window AS sum_total_amt_usd
    ,COUNT(total_amt_usd) OVER account_year_window AS count_total_amt_usd
    ,AVG(total_amt_usd) OVER account_year_window AS avg_total_amt_usd
    ,MIN(total_amt_usd) OVER account_year_window AS min_total_amt_usd
    ,MAX(total_amt_usd) OVER account_year_window AS max_total_amt_usd
FROM orders
WINDOW account_year_window AS (PARTITION BY account_id ORDER BY DATE_TRUNC('year', occurred_at))

 * postgresql://localhost/parchposey
6912 rows affected.

[(4307, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('8757.18'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (3, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('776.18'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (2, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('1718.03'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (1, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('973.43'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71')),
 (4308, 1001, datetime.datetime(2015, 1, 1, 0, 0), 1, Decimal('9426.71'), Decimal('21651.53'), 5, Decimal('4330.3060000000000000'), Decimal('776.18'), Decimal('9426.71'))]

In the previous video, Derek outlines how to compare a row to a previous or subsequent row. This technique can be useful when analyzing time-based events. Imagine you're an analyst at Parch & Posey and you want to determine how the current order's total revenue ("total" meaning from sales of all types of paper) compares to the next order's total revenue.

Modify Derek's query from the previous video in the SQL Explorer below to perform this analysis. You'll need to use occurred_at and total_amt_usd in the orders table along with LEAD to do so. In your query results, there should be four columns: occurred_at, total_amt_usd, lead, and lead_difference.

In [105]:
%%sql
SELECT 
    occurred_at
    ,total_amt_usd
    ,LEAD(total_amt_usd) OVER (ORDER BY occurred_at) AS lead
    ,LEAD(total_amt_usd) OVER (ORDER BY occurred_at) - total_amt_usd AS lead_difference
FROM orders

 * postgresql://localhost/parchposey
6912 rows affected.

[(datetime.datetime(2013, 12, 4, 4, 22, 44), Decimal('627.48'), Decimal('2646.77'), Decimal('2019.29')),
 (datetime.datetime(2013, 12, 4, 4, 45, 54), Decimal('2646.77'), Decimal('2709.62'), Decimal('62.85')),
 (datetime.datetime(2013, 12, 4, 4, 53, 25), Decimal('2709.62'), Decimal('277.13'), Decimal('-2432.49')),
 (datetime.datetime(2013, 12, 5, 20, 29, 16), Decimal('277.13'), Decimal('3001.85'), Decimal('2724.72')),
 (datetime.datetime(2013, 12, 5, 20, 33, 56), Decimal('3001.85'), Decimal('2802.90'), Decimal('-198.95'))]

In the provided solution a subquery was run which calculated SUM(), GROUPed on occurred_at.
I'm not sure why that was necessary. total_amt_usd already denotes a total order value for any order.

Use the NTILE functionality to divide the accounts into 4 levels in terms of the amount of standard_qty for their orders. Your resulting table should have the account_id, the occurred_at time for each order, the total amount of standard_qty paper purchased, and one of four levels in a standard_quartile column.

In [106]:
%%sql
SELECT
    account_id
    ,occurred_at
    ,standard_qty
    ,NTILE(4) OVER (PARTITION BY account_id ORDER BY standard_qty)
FROM orders
ORDER BY 1

 * postgresql://localhost/parchposey
6912 rows affected.

[(1001, datetime.datetime(2015, 12, 4, 4, 21, 55), 85, 1),
 (1001, datetime.datetime(2016, 5, 31, 21, 22, 48), 91, 1),
 (1001, datetime.datetime(2016, 6, 30, 12, 32, 5), 94, 1),
 (1001, datetime.datetime(2016, 5, 1, 15, 55, 51), 95, 1),
 (1001, datetime.datetime(2016, 10, 26, 20, 31, 30), 97, 1)]

Use the NTILE functionality to divide the accounts into two levels in terms of the amount of gloss_qty for their orders. Your resulting table should have the account_id, the occurred_at time for each order, the total amount of gloss_qty paper purchased, and one of two levels in a gloss_half column.

In [107]:
%%sql
SELECT
    account_id
    ,occurred_at
    ,gloss_qty
    ,NTILE(2) OVER (PARTITION BY account_id ORDER BY gloss_qty)
FROM orders
ORDER BY 1

 * postgresql://localhost/parchposey
6912 rows affected.

[(1001, datetime.datetime(2016, 9, 26, 23, 28, 25), 10, 1),
 (1001, datetime.datetime(2016, 5, 31, 21, 22, 48), 16, 1),
 (1001, datetime.datetime(2015, 10, 6, 17, 31, 14), 22, 1),
 (1001, datetime.datetime(2016, 3, 2, 15, 29, 32), 24, 1),
 (1001, datetime.datetime(2016, 2, 1, 19, 27, 27), 29, 1)]

Use the NTILE functionality to divide the orders for each account into 100 levels in terms of the amount of total_amt_usd for their orders. Your resulting table should have the account_id, the occurred_at time for each order, the total amount of total_amt_usd paper purchased, and one of 100 levels in a total_percentile column.

In [108]:
%%sql
SELECT
    account_id
    ,occurred_at
    ,total_amt_usd
    ,NTILE(100) OVER (PARTITION BY account_id ORDER BY total_amt_usd)
FROM orders
ORDER BY 1

 * postgresql://localhost/parchposey
6912 rows affected.

[(1001, datetime.datetime(2016, 5, 31, 21, 22, 48), Decimal('752.57'), 1),
 (1001, datetime.datetime(2016, 7, 30, 3, 26, 30), Decimal('773.63'), 2),
 (1001, datetime.datetime(2015, 12, 4, 4, 21, 55), Decimal('776.18'), 3),
 (1001, datetime.datetime(2016, 6, 30, 12, 32, 5), Decimal('878.56'), 4),
 (1001, datetime.datetime(2016, 9, 26, 23, 28, 25), Decimal('951.14'), 5)]

In the above solution, I noted that in many cases values towards zero were returned, and none close to 100.
This is because NTILE() does not apportion the %age range over the input values as we'd expect. So each sequentially
larger value seems to be assigned a +1 %age. So if there are 28 different values, the ntile column will only get
to 28.

This can be avoided by utilising larger NTILE size "buckets"

## Self JOINs

In the above solution, I noted that in many cases values towards zero were returned, and none close to 100.
This is because NTILE() does not apportion the %age range over the input values as we'd expect. So each sequentially
larger value seems to be assigned a +1 %age. So if there are 28 different values, the ntile column will only get
to 28.

This can be avoided by utilising larger NTILE size "buckets"

One of the most common use cases for self JOINs is in cases where two events occurred, one after another. As you may have noticed in the previous video, using inequalities in conjunction with self JOINs is common.

Modify the query from the previous video, which is pre-populated in the SQL Explorer below, to perform the same interval analysis except for the web_events table. Also:

* Change the interval to 1 day to find those web events that occurred after, but not more than 1 day after, another web event
* Add a column for the channel variable in both instances of the table in your query
You can find more on the types of INTERVALS (and other date related functionality) in the Postgres documentation here.

In [109]:
%%sql
SELECT 
    w1.id AS w1_id
    ,w1.account_id AS w1_account_id
    ,w1.occurred_at AS w1_occurred_at
    ,w1.channel AS w1_channel
    ,w2.id AS w2_id
    ,w2.account_id AS w2_account_id
    ,w2.occurred_at AS w2_occurred_at
    ,w2.channel AS w2_channel
  FROM web_events w1
 LEFT JOIN web_events w2
   ON w1.account_id = w2.account_id
  AND w2.occurred_at > w1.occurred_at
  AND w2.occurred_at <= w1.occurred_at + INTERVAL '1 day'
ORDER BY w1.account_id, w1.occurred_at

 * postgresql://localhost/parchposey
9148 rows affected.

[(4394, 1001, datetime.datetime(2015, 10, 6, 4, 22, 11), 'facebook', 1, 1001, datetime.datetime(2015, 10, 6, 17, 13, 58), 'direct'),
 (1, 1001, datetime.datetime(2015, 10, 6, 17, 13, 58), 'direct', None, None, None, None),
 (4395, 1001, datetime.datetime(2015, 10, 22, 5, 2, 47), 'organic', 4396, 1001, datetime.datetime(2015, 10, 22, 14, 4, 20), 'adwords'),
 (4396, 1001, datetime.datetime(2015, 10, 22, 14, 4, 20), 'adwords', None, None, None, None),
 (2, 1001, datetime.datetime(2015, 11, 5, 3, 8, 26), 'direct', 4397, 1001, datetime.datetime(2015, 11, 5, 17, 18, 54), 'direct')]